Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བསྟན་པ་ལ། དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་ལྟ་བུར་མོས་པ་སྤེལ་བས་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་ལ་སོགས་པ་དང་ལྡན་པའི་ཁ་དོག་གི་འདུ་ཤེས་ཀྱིས་སྐྱོ་ཞིང་འདོད་ཆགས་དང་བྲལ་བའི་དབང་གིས་མེད་པར་གྱུར་པ་བསྟན་ཏོ།
en: As for the teaching about the four formless absorptions, “totally transcending perceptions of form” teaches that color perceptions endowed with blue, yellow, red, white and so on have become nonexistent because they are disgusted by them and separate from attachment to them through an increase in admiration for the space-like.

source: །དེ་བས་ན་ནམ་མཁའ་ལྟ་བུར་མོས་པ་བསྒོམ་པ་གོམས་པས། གཟུགས་ཀྱི་འདུ་ཤེས་དེ་དག་ལས་ཡང་དག་པར་འདས་པས་ཁ་དོག་རྣམ་པ་དུ་མ་བརྩེགས་པའི་རྒྱུ་ལས་བྱུང་བ། ཀ་བ་དང་། རྩིག་པ་དང་། ཤིང་ལེབ་ལ་སོགས་པ་སྒྲིབ་པའི་འདུ་ཤེས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་སྣང་བར་མི་འགྱུར་ཏེ། དེ་བས་ན་ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཞེས་བྱ་བ་གསུངས་སོ། །དེ་དག་མེད་པར་གྱུར་པས་གཟུ
en: Hence, on account of habituation to the meditation on an admiration for the space-like, they transcend those perceptions of form and so on, and all the perceptions of obstruction from pillars, walls, planks and so on, caused by many various layers of colors, do not arise, so it says “setting to rest perceptions of obstruction.”

source: གས་རྣམ་པ་སྣ་ཚོགས་མང་པོ་ལ་ཞུགས་པ་བཟའ་བ་དང་བཏུང་བ་དང་། བཞོན་པ་དང་། གོས་དང་། རྒྱན་དང་། ཁྱིམ་དང་། སྐྱེད་མོས་ཚལ་དང་རི་ལ་སོགས་པའི་འདུ་ཤེས་སྣ་ཚོགས་གང་ཡིན་པ་དེ་དག་ལ་རྩོལ་བ་མི་འཇུག་པའི་ཕྱིར། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ཞེས་བྱ་བ་གསུངས་སོ།
en: When they have disappeared, the energy in the various perceptions of food, drink, vehicles, clothes, ornaments, homes, parks, mountains and so on that are expressed in many various forms stops operating, so it says, “not paying attention to perceptions of difference.”

source: །གཟུགས་ལ་དམིགས་པའི་འདུ་ཤེས་དེ་དག་ཐམས་ཅད་རྣམ་པར་བཤིག་པས་ནམ་མཁའ་མཐའ་ཡས་པའི་རྣམ་པར་མོས་པར་འགྱུར་ཏེ། དེ་བས་ན། ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Because all those perceptions apprehending form have been destroyed, an admiration in the form of endless space comes about, so it says “in endless space they perfectly accomplish and dwell in the station of endless space.” “

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས་ཞེས་བྱ་བ་ནི་དེ་རྣམ་པར་ཤེས་པ་གང་གིས་ནམ་མཁའ་མཐའ་ཡས་པར་མོས་པའི་རྣམ་པར་ཤེས་པ་ནམ་མཁའ་མཐའ་ཡས་པའི་རྣམ་པར་མོས་པ་དེ་ཉིད་མཐའ་ཡས་པ་ཉིད་དུ་བཟུང་སྟེ། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པར་འདོད་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་འདུ་ཤེས་རྣམ་པར་བཟློག་སྟེ། རྣམ་པར་ཤེས་པ་ཉིད་མཐའ་ཡས་པའི་རྣམ་པར་མོས་པར་བྱེད་དོ།
en: Totally transcending the station of endless space, in endless consciousness”— that consciousness on account of which the consciousness that is an admiration in the form of endless space is an admiration in the form of endless space—having taken that itself as endless, they want to become absorbed in the station of endless consciousness, so they recoil from the perception of the station of endless space and admire the state of consciousness as endless.

source: །དེ་བས་ན་རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore, it says endless consciousness. “

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་ཞེས་བྱ་བ་ནི་དེས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་བསྐྱོད་དེ་རྣམ་པར་ཤེས་པ་ལས་གུད་ན་དམིགས་པ་གཞན་བཙལ་ན་གཟུགས་ཅན་ནམ། གཟུགས་མེད་པ་ཅི་ཡང་མ་རྙེད་དོ།
en: Totally transcending the station of endless consciousness”— they move off from endless consciousness, and when they search for some other objective support besides consciousness they find nothing material or nonmaterial at all.

source: །དེས་དམིགས་པ་དེ་མ་རྙེད་པས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: When they do not find that objective support they transcend even the station of endless consciousness.

source: ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཉིད་ལ་དམིགས་ནས་མོས་ཤིང་བསྒོམས་ཏེ་སྙོམས་པར་འཇུག་གོ།
en: They take just the station of nothing-at-all as their objective support and, having meditated on it, become absorbed in it.

source: །དེ་བས་ན་ཅི་ཡང་མེད་དོ་སྙམ་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore, it says “in nothing-at-all they perfectly accomplish and dwell in the station of nothing-at-all.” “

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཞེས་བྱ་བ་ནི་དེས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་འདུ་ཤེས་དེ་ལ་རགས་པའི་ཉེས་དམིགས་སུ་མཐོང་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་འདུ་ཤེས་ལས་རྣམ་པར་བཟློག་གོ།
en: Totally transcending the station of nothing-at-all”— having come to see the perception of the station of nothing-at-all as flawed by grossness, they recoil from the perception of the station of nothing-at-all.

source: །དེས་སྔར་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའི་དུས་ན་ཅི་ཞིག་ཡོད་པའི་འདུ་ཤེས་རྣམ་པར་བཟློག་གོ།
en: Earlier, during the period of absorption into the station of nothing-at-all they recoiled from the perception of something being there.

source: །ད་ནི་ཅི་ཡང་མེད་པའི་འདུ་ཤེས་ལས་རྣམ་པར་བཟློག་པས་དེས་ན་འདུ་ཤེས་མེད་ཅེས་བྱ་སྟེ། འདི་ལྟ་སྟེ། སེམས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལྟར་འདུ་ཤེས་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་འགགས་པ་ནི་མ་ཡིན་གྱི། ཤིན་ཏུ་ཕྲ་བའི་ཕྱིར་མཚན་མ་མེད་པའི་འདུ་ཤེས་གང་ཡིན་པ་དེ་འབྱུང་སྟེ།
en: Now they recoil from the perception of nothing at all, so it is “neither perception,” which is to say, it is not like a mindless absorption in which there is the cessation of all perceptions in each and every way, but rather the emergence of a perception without causal signs, because it is extremely subtle.

source: དེ་བས་ན། འདུ་ཤེས་མེད་མིན་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore, it says “nor nonperception.”

source: །རྣམ་པར་ཐར་པ་བསྟན་པ་ལ། གཟུགས་ཅན་གཟུགས་རྣམས་ལ་ལྟ་བ་ཞེས་བྱ་བ་ནི་ནང་གི་གཟུགས་ལ་དམིགས་པའི་སྙོམས་པར་འཇུག་པ་ཐོབ་པའི་ཕྱི་རོལ་གྱི་གཟུགས་རྣམས་ལ་དམིགས་ནས་སྙོམས་པར་འཇུག་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: As for the teaching about the eight deliverances, “with form they see forms” means they have reached the absorption that apprehends inner form and are absorbed in apprehending outer forms.

source: །འདི་ལ་ཡང་རྣམ་པར་ཐར་པ་སྔ་མ་གཉིས་ནི་མི་སྡུག་པ་ཉིད་དེ། དེ་དག་ཀྱང་བསམ་གཏན་དང་པོ་དང་། གཉིས་པའི་རང་བཞིན་ནོ།
en: Of them, furthermore, it will be explained that the two earlier deliverances are just the unpleasantness, which is to say they are in their nature the first and second concentrations.

source: །རྣམ་པར་ཐར་པ་གསུམ་པ་ནི་བསམ་གཏན་བཞི་པའི་རང་བཞིན་ཏེ།
en: The third deliverance is in its nature the fourth concentration and furthermore has nonattachment as its intrinsic nature.

source: དེ་ཡང་ཆགས་པ་མེད་པའི་ངོ་བོ་ཉིད་དོ་ཞེས་འཆད་དོ། །འདི་ལ་ཡང་བསམ་གཏན་དང་པོ་འདོད་པ་ན་སྤྱོད་པའི་ཁ་དོག་ལ་འདོད་ཆགས་པའི་གཉེན་པོར་ནང་གི་སྐྲ་ལ་སོགས་པ་ལ་དམིགས་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་ཞུགས་ནས་དེའི་འོག་ཏུ་ཕྱི་རོལ་གྱི་རྣམ་པར་བསྔོས་པ་ལ་སོགས་པ་ལ་དམིགས་ཏེ། བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་པ་ན་གཟུགས་ཅན་གཟུགས་རྣམས་ལ་ལྟ་བ་ཞེས་བྱའོ།
en: About these, furthermore, having become absorbed in the first concentration, the absorption that apprehends hair and so on, which counteracts the attachment those living in the desire realm have to color, when they then take a black and blue corpse and so on outside as their objective support and enter into absorption in the first concentration, it is said “with form they see forms.”

source: །དེ་བཞིན་དུ་བསམ་གཏན་དང་པོའི་ས་པའི་ཁ་དོག་ལ་འདོད་ཆགས་པའི་གཉེན་པོར་བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་འཇུག་པ་ན་ཡང་གཟུགས་ཅན་གཟུགས་རྣམས་ལ་ལྟ་བ་ཞེས་བྱ་སྟེ།
en: Similarly, when they enter into absorption in the second concentration, which counteracts the attachment of those at the first concentration level to color, it is also said “with form they see forms.”

source: ནང་གི་གཟུགས་ལ་དམིགས་པའི་དབང་གིས་ནི་གཟུགས་ཅན་ཞེས་བྱའོ། །ཕྱི་རོལ་གྱི་གཟུགས་ལ་དམིགས་པའི་སྙོམས་པར་འཇུག་པའི་དབང་གིས་ནི་གཟུགས་རྣམས་ལ་ལྟ་བ་ཞེས་བྱའོ། །འདིར་ཡང་སྙོམས་པར་འཇུག་པའི་དབང་གིས་གཟུགས་ལ་ལྟ་བ་ཞེས་བྱའོ།
en: It says “with form” based on their apprehending inner form, and it says “they see forms” based on the absorption apprehending outer forms.

source: །གཉིས་པ་ལ་ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པ་ཕྱི་རོལ་གྱི་གཟུགས་རྣམས་ལ་ལྟ་བ་ཞེས་བྱ་བ་ནི་རྣལ་འབྱོར་སྤྱོད་པ་ལ་ལ་ནང་གི་སྐྲ་ལ་སོགས་པ་དམིགས་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་མི་འཇུག་སྟེ། ཕྱི་རོལ་གྱི་རྣམ་པར་བསྔོས་པ་ལ་སོགས་པ་དམིགས་པ་ན་འདོད་པ་ན་སྤྱོད་པའི་ཁ་དོག་ལ་འདོད་ཆགས་པ་ལ་སོགས་པའི་གཉེན་པོར་བསམ་གཏན་དང་པོ་འམ། བསམ་གཏན་དང་པོའི་ས་པའི་ཁ་དོག་ལ་འདོད་ཆགས་པ་ལ་སོགས་པའི་གཉེན་པོར་བསམ་གཏན་གཉིས་པ་ལ་སྙོམས་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: As for the second, “with the perception of form inside, they see forms outside” means when certain yogic practitioners not absorbed in the absorption apprehending hair and so on inside, apprehend a black and blue corpse and so on outside, they become absorbed in the first concentration, which counteracts the attachment those living in the desire realm have to color, or in the second concentration, which counteracts the attachment of those at the first concentration level to color. “

source: །སྡུག་པར་མོས་པ་ཞེས་བྱ་བ་འདི་ནི་སྡུག་པའི་རྣམ་པར་ཐར་པའོ།
en: They have admiration for the pleasant” is the pleasant deliverance.

source: །མི་སྡུག་པའི་རྣམ་པར་བསྒོམས་པས་སེམས་ཀྱི་རྒྱུད་ཞུམ་པ་དགའ་བར་བྱ་བ་འམ། ཅི་བདག་ཡིད་དུ་འོང་བའི་གཟུགས་རྣམས་སྡུག་པ་ཉིད་དུ་ཡིད་ལ་བྱེད་ན་ཁ་དོག་ལ་འདོད་ཆགས་པ་ལ་སོགས་པའི་དབང་གིས་སེམས་ཀྱི་རྒྱུད་གཞན་དུ་འགྱུར་རམ། འོན་ཏེ་མི་འགྱུར་ཞེས་སད་པའི་ཕྱིར་དེ་བསྒོམ་སྟེ།
en: They cultivate it in order to make themselves feel joy when their minds are cowed from having meditated on the unpleasant, or, when they pay attention to their own pleasing form as in fact pleasing, to see whether, based on an attachment to color and so on, their minds change or do not change.

source: ཡིད་དུ་འོང་བའི་གཟུགས་ལ་སོགས་པ་ལ་དམིགས་ནས། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པ་ན་སྡུག་པར་མོས་པ་ཞེས་བྱའོ།
en: So, taking a beautiful form and so on as their objective support and becoming absorbed in the fourth concentration is called “admiration for the pleasant.”

source: །སྙོམས་པར་འཇུག་པའི་སྐད་ཅིག་ལ་སྡུག་པ་ལ་སོགས་པའི་རྣམ་པར་རྟོག་པ་མེད་དུ་ཟིན་ཀྱང་སྔོན་དུ་འཇུག་པའི་དབང་གིས་དེ་སྐད་བྱའོ་ཞེས་འཆད་དོ།
en: It is said that even though there is no conceptualization of “pleasant” and so on in the moment of absorption, the locution is used governed by it being there earlier.

source: །གཟུགས་མེད་པའི་རྣམ་པར་ཐར་པ་རྣམས་ནི་བཤད་ཟིན་ཏོ།
en: I have already explained the formless deliverances. “

source: །བསམ་གཏན་དང་། གཟུགས་མེད་པ་བརྒྱད་དང་། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུའོ།། །།
en: The nine serial absorptions” are the eight—the concentrations and the formless absorptions—and the cessation of perceptions and feelings.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་སྟེ་ཞེས་བྱ་བ་ལ་གནས་ལ་ཡང་གནས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: Great Vehicle of the ten powers In regard to the ten powers of a tathāgata, they are the following.

source: །གནས་མ་ཡིན་པ་ལ་ཡང་གནས་མ་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བ་དེ་ལ་གནས་ནི་གང་།
en: First power “Accurately knowing the possible as possible, and accurately knowing the impossible as impossible.”

source: གནས་མ་ཡིན་པ་ནི་གང་ཞེ་ན།
en: There, what is “the possible” and what is “the impossible”?

source: ཉེས་པར་སྤྱོད་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡིད་དུ་མི་འོང་བ་ནི་གནས་སོ། །རྣམ་པར་སྨིན་པ་ཡིད་དུ་འོང་བ་ནི་གནས་མ་ཡིན་པའོ།
en: An unpleasant maturation from wrongdoing is possible; a pleasant maturation is impossible.

source: །ལེགས་པར་སྤྱོད་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡིད་དུ་འོང་བ་ནི་གནས་སོ། །རྣམ་པར་སྨིན་པ་ཡིད་དུ་མི་འོང་བ་ནི་གནས་མ་ཡིན་པའོ།
en: A pleasant maturation from good deeds is possible; an unpleasant maturation is impossible.

source: །སེར་སྣས་དབུལ་པོར་འགྱུར་བ་ནི་གནས་སོ། །ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Poverty from miserliness is possible; great wealth is impossible.

source: །སྦྱིན་པས་ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བ་ནི་གནས་སོ། །དབུལ་པོར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Great wealth from giving is possible; poverty is impossible.

source: །འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱིས་ངན་འགྲོར་སྐྱེ་བ་ནི་གནས་སོ། །བདེ་འགྲོར་སྐྱེ་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Birth in a bad form of life from immorality is possible; birth in a good form of life is impossible.

source: །ཚུལ་ཁྲིམས་ཀྱིས་བདེ་འགྲོར་སྐྱེ་བ་ནི་གནས་སོ། །ངན་འགྲོར་སྐྱེ་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Birth in a good form of life from morality is possible; birth in a bad form of life is impossible.

source: །གནོད་སེམས་ཀྱིས་གཟུགས་མི་སྡུག་པར་འགྱུར་བ་ནི་གནས་སོ། །གཟུགས་བཟང་པོར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Physical ugliness from malice is possible; physical beauty is impossible.

source: །བཟོད་པས་གཟུགས་མཛེས་པར་འགྱུར་བ་ནི་གནས་སོ། །གཟུགས་མི་སྡུག་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Beauty from patience is possible; ugliness is impossible.

source: །ལེ་ལོས་མངོན་པར་རྟོགས་པར་མི་འགྱུར་བ་ནི་གནས་སོ། །མངོན་པར་རྟོགས་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: No clear realization from laziness is possible; clear realization is impossible.

source: །བརྩོན་འགྲུས་ཀྱིས་བདེན་པ་མངོན་པར་རྟོགས་པ་ནི་གནས་སོ། །མངོན་པར་རྟོགས་པར་མི་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Clear realization of the truths from perseverance is possible; not clearly realizing the truths is impossible.

source: །རྣམ་པར་གཡེང་བས་སྐྱོན་མེད་པ་ལ་མི་འཇུག་པ་ནི་གནས་སོ། །སྐྱོན་མེད་པ་ལ་འཇུག་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Not entering into the secure state from distraction is possible; entering into the secure state is impossible.

source: །བསམ་གཏན་གྱིས་ཡང་དག་པ་ཉིད་ལ་འཇུག་པ་ནི་གནས་སོ། །མི་འཇུག་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Entering into true reality through concentration is possible; not entering is impossible.

source: །འཆལ་བའི་ཤེས་རབ་ཀྱིས་བྱང་ཆུབ་འཐོབ་པ་མེད་པ་ནི་གནས་སོ། །བྱང་ཆུབ་འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Not reaching awakening with intellectual confusion is possible; reaching awakening is impossible.

source: །ཤེས་རབ་ཀྱིས་བྱང་ཆུབ་ཐོབ་པ་ནི་གནས་སོ། །མི་འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Reaching awakening with wisdom is possible; not reaching awakening is impossible.

source: །སྲོག་གཅོད་པས་ཚེ་ཐུང་བར་འགྱུར་བ་ནི་གནས་སོ། །ཚེ་རིང་པོར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Having a short life from killing is possible; having a long life is impossible.

source: །དེ་སྤངས་པས་ཚེ་རིང་པོར་འགྱུར་བ་ནི་གནས་སོ། །ཚེ་ཐུང་བར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Having a long life from abandoning that is possible; having a short life is impossible.

source: །མ་བྱིན་པར་ལེན་པས་ལོངས་སྤྱོད་ཆེན་པོ་འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ། །དབུལ་པོར་འགྱུར་བ་ནི་གནས་སོ།
en: Gaining great wealth from stealing is impossible; poverty is possible.

source: །དེ་སྤངས་པས་ལོངས་སྤྱོད་འཐོབ་པ་ནི་གནས་སོ།།དབུལ་པོར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Gaining wealth from abandoning that is possible; poverty is impossible.

source: །འདོད་པ་ལ་ལོག་པར་གཡེམ་པས་འགྲན་ཟླ་དང་བཅས་པའི་ཆུང་མ་རྙེད་པ་ནི་གནས་སོ། །འགྲན་ཟླ་མེད་པའི་ཆུང་མ་རྙེད་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Finding a wife who you have to compete for from adultery is possible; finding a wife who you do not have to compete for is impossible.

source: །དེ་སྤངས་པས་འགྲན་ཟླ་མེད་པའི་ཆུང་མ་རྙེད་པ་ནི་གནས་སོ། །འགྲན་ཟླ་དང་བཅས་པའི་ཆུང་མ་རྙེད་པ་ནི་གནས་མ་ཡིན་པའོ། །{
en: Finding a wife who you do not have to compete for from abandoning that adultery is possible; not finding a wife who you do not have to compete for is impossible.

source: བརྫུན་,རྫུན་}དུ་སྨྲ་བས་སྐུར་པ་འདེབས་པ་ཐོབ་པ་ནི་གནས་སོ། །དེ་མི་འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Getting slandered is possible from lying; not getting slandered is impossible.

source: །དེ་སྤངས་པས་དེ་མི་འཐོབ་པ་ནི་གནས་སོ།
en: Not getting slandered from abandoning that is possible; getting slandered from abandoning that is impossible.

source: །དེ་འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ། །ཕྲ་མས་འཁོར་མི་ཕྱེད་པ་མི་རྙེད་པ་ནི་གནས་སོ།
en: Not getting unity from speaking behind a person’s back is possible; getting it is impossible.

source: །རྙེད་པ་ནི་གནས་མ་ཡིན་པའོ། །དེ་སྤངས་པས་འཁོར་མི་ཕྱེད་པ་རྙེད་པ་ནི་གནས་སོ།
en: Getting unity from abandoning that is possible; not getting it is impossible.

source: །མི་རྙེད་པ་ནི་གནས་མ་ཡིན་པའོ། །ཚིག་རྩུབ་པོས་རྟག་པར་མི་སྙན་པ་ཐོས་པ་ནི་གནས་སོ། །མི་ཐོས་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Always hearing something unpleasant from shouting is possible; not hearing that is impossible.

source: །དེ་སྤངས་པས་རྟག་ཏུ་སྙན་པ་ཐོས་པ་ནི་གནས་སོ། །མི་ཐོས་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Always hearing something pleasant from abandoning that is possible; not hearing that is impossible.

source: །ཚིག་འཁྱལ་པས་ཚིག་བཙུན་པར་མི་འགྱུར་བ་ནི་གནས་སོ། །ཚིག་བཙུན་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Your words not being treated with respect from idle chatter is possible; your words being treated with respect is impossible.

source: །དེ་སྤངས་པས་ཚིག་བཙུན་པར་འགྱུར་བ་ནི་གནས་སོ། །ཚིག་བཙུན་པར་མི་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Your words being treated with respect from abandoning that is possible; your words not being treated with respect is impossible.

source: །བརྣབ་སེམས་ཀྱིས་ལོངས་སྤྱོད་རྣམ་པར་འཇིག་པ་ནི་གནས་སོ།
en: Wealth dissipating from covetousness is possible; its not dissipating is impossible.

source: །རྣམ་པར་མི་འཇིག་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Wealth not dissipating from abandoning that is possible; its dissipating is impossible.

source: །གནོད་སེམས་ཀྱིས་སེམས་ཅན་དམྱལ་བར་འགྲོ་བ་ནི་གནས་སོ། །བདེ་འགྲོར་འགྲོ་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Going to hell from malice is possible; going to a good form of life is impossible.

source: །དེ་སྤངས་པས་བདེ་འགྲོར་འགྲོ་བ་ནི་གནས་སོ།
en: Going to a good form of life is possible from abandoning that.

source: །ལོག་པར་ལྟ་བས་འཕགས་པའི་ལམ་ཐོབ་པར་མི་འགྱུར་བ་ནི་གནས་སོ། །འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Not reaching the noble path with a wrong view is possible; reaching it is impossible.

source: །ཡང་དག་པའི་ལྟ་བས་འཕགས་པའི་ལམ་འཐོབ་པ་ནི་གནས་སོ། །མི་འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Reaching the noble path with a right view is possible; not reaching it is impossible.

source: །མཚམས་མེད་པ་བྱེད་པས་ཏིང་ངེ་འཛིན་རྣམས་མི་འཐོབ་པ་ནི་གནས་སོ།
en: Not obtaining the meditative stabilizations from a crime that brings immediate retribution is possible; obtaining them is impossible.

source: །འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ། །ཚུལ་ཁྲིམས་དང་ལྡན་པས་འཐོབ་པ་ནི་གནས་སོ། །མི་འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Obtaining them from being moral is possible; not obtaining them is impossible.

source: །དམིགས་པའི་ལྟ་བས་རྗེས་སུ་མཐུན་པའི་བཟོད་པ་མི་འཐོབ་པ་ནི་གནས་སོ། །འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ།
en: Not obtaining forbearance in accord with the four noble truths with a view that apprehends something is possible; obtaining it is impossible.

source: །སྟོང་པ་ཉིད་ལ་གནས་པས་རྗེས་སུ་མཐུན་པའི་བཟོད་པ་འཐོབ་པ་ནི་གནས་སོ། །མི་འཐོབ་པ་ནི་གནས་མ་ཡིན་པའོ། །འགྱོད་པ་དང་ལྡན་པས་སེམས་གཡེང་བ་ནི་གནས་སོ། །སེམས་ཤིན་ཏུ་སྦྱངས་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ། །འགྱོད་པ་མེད་པས་སེམས་ཤིན་ཏུ་སྦྱངས་པར་འགྱུར་བ་ནི་གནས་སོ། །གཡེང་བར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: Obtaining forbearance in accord with the four noble truths from abiding in emptiness is possible; not obtaining it is impossible.

source: །གང་བུད་མེད་འཁོར་ལོས་སྒྱུར་བ་འམ། བརྒྱ་བྱིན་ནམ། ཚངས་པ་འམ། དབང་སྒྱུར་རམ། སངས་རྒྱས་སུ་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ།
en: A girl who might become a wheel-turning emperor, or an Indra, Brahmā, Vaśavartin, or buddha, is impossible; a boy who might become one of those is possible.

source: །གང་སྐྱེས་པས་དེ་དག་ཏུ་འགྱུར་བ་ནི་གནས་སོ། །གང་བརྒྱད་པའི་གང་ཟག་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་མ་ཐོབ་པར་སྟན་ལས་ལྡང་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་ནས་ལྡང་བ་ནི་གནས་སོ། །གང་རྒྱུན་ཏུ་ཞུགས་པའི་སྲིད་པ་བརྒྱད་པ་ལེན་པ་ནི་གནས་མ་ཡིན་པའོ། །གང་མི་ལེན་པ་ནི་གནས་སོ།
en: An eighth person who gets up from his seat without having gained the result of stream enterer is impossible; one who gets up having gained the result of stream enterer is possible.

source: །གང་ལན་ཅིག་ཕྱིར་འོང་བ་སྲིད་པ་གསུམ་པ་ལེན་པ་ནི་གནས་མ་ཡིན་པའོ། །གང་མི་ལེན་པ་ནི་གནས་སོ།
en: A once-returner who takes a third existence is impossible; one who does not take one is possible.

source: །གང་ཕྱིར་མི་འོང་བ་འཇིག་རྟེན་འདིར་འོང་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་ཕྱིར་མི་འོང་བ་ནི་གནས་སོ།
en: A non-returner who returns to this world is impossible; one who does not return is possible.

source: །གང་དགྲ་བཅོམ་པ་ལས་དང་ཉོན་མོངས་པའི་དབང་གིས་ཉིང་མཚམས་སྦྱོར་བར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་མི་འགྱུར་བ་ནི་གནས་སོ།
en: A worthy one who links up with another existence under the force of afflictions and karma is impossible; one who does not is possible.

source: །གང་འཕགས་པའི་གང་ཟག་སྟོན་པ་གཞན་ཚོལ་བ་ནི་གནས་མ་ཡིན་པའོ།
en: A noble person who searches for another teacher is impossible; one who does not is possible.

source: །གང་མི་ཚོལ་བ་ནི་གནས་སོ། །གང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་ནི་གནས་སོ། །ཕྱིར་ལྡོག་པ་ནི་གནས་མ་ཡིན་པའོ།
en: That bodhisattvas who have obtained forbearance for dharmas that are not produced are irreversible is possible; that they are reversible is impossible.

source: །གང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པར་སྟན་ལས་ལྡང་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ལྡང་བ་ནི་གནས་སོ།
en: That bodhisattvas seated at the site of awakening will get up from their seat before fully awakening to unsurpassed, perfect, complete awakening is impossible; that they will get up fully awakened is possible.

source: །གང་སངས་རྒྱས་རྣམས་ལ་བག་ཆགས་ཀྱི་གནས་ཡོད་པ་ནི་གནས་མ་ཡིན་པའོ།
en: That there are residual impression connections in a buddha is impossible; that they have been eliminated completely is possible.

source: །གང་མ་ལུས་པར་སྤངས་པ་ནི་གནས་སོ། །གང་དེ་བཞིན་གཤེགས་པའི་མཁྱེན་པ་གང་ལ་ཡང་ཐོགས་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པ་ནི་གནས་སོ།
en: That the knowledge of a tathāgata is obstructed by anything at all is impossible; that it is totally unobstructed is possible.

source: །གང་དེ་བཞིན་གཤེགས་པའི་སྤྱི་གཙུག་སུས་ཀྱང་མཐོང་བར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་དེ་བཞིན་གཤེགས་པའི་སྤྱི་གཙུག་སུས་ཀྱང་མི་མཐོང་བ་ནི་གནས་སོ།
en: That anyone sees the top of a tathāgata’s head is impossible; that nobody sees the top of a tathāgata’s head is possible.

source: །གང་དེ་བཞིན་གཤེགས་པའི་ཐུགས་འགྱུར་བར་སྣང་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་མི་སྣང་བ་ནི་གནས་སོ།
en: That tathāgatas appear to change their minds is impossible; that they do not appear to do so is possible.

source: །གང་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྣམ་པར་གཡེང་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་རྟག་ཏུ་མཉམ་པར་གཞག་པ་ནི་གནས་སོ།
en: That the minds of tathāgatas might become distracted is impossible; that they are always in meditative equipoise is possible.

source: །གང་དེ་བཞིན་གཤེགས་པ་ལོག་པར་གསུང་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་ལོག་པར་མི་གསུང་བ་ནི་གནས་སོ།
en: That tathāgatas might speak falsely is impossible; that they would not speak falsely is possible.

source: །གང་སངས་རྒྱས་རྣམས་ཀྱི་གསུང་ལ་འཁྲུལ་པ་ཡོད་པ་ནི་གནས་མ་ཡིན་པའོ། །གང་མེད་པ་ནི་གནས་སོ།
en: That there might be a mistake in what the buddhas say is impossible; that there never is, is possible.

source: །གང་དེ་བཞིན་གཤེགས་པ་གང་དུ་ཡང་བག་ཚ་བ་དང་། བསྙེངས་པར་འགྱུར་བ་ནི་གནས་མ་ཡིན་པའོ། །གང་ཐམས་ཅད་དུ་བག་ཚ་བ་དང་། བསྙེངས་པ་མི་མངའ་བ་ནི་གནས་སོ།
en: That tathāgatas would fear or be scared of anything is impossible; that tathāgatas are totally without fear and not scared by anything is possible.

source: །དེ་དག་ལ་སོགས་པ་ནི་གནས་དང་གནས་མ་ཡིན་པ་ཞེས་བྱ་སྟེ།
en: Those and so on are “possible and impossible.”

source: དེ་ཤེས་པ་ནི་གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་ཞེས་བྱའོ།
en: Knowledge of those is “the power of knowing what is and is not possible.”

source: །ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མཁྱེན་པའི་སྟོབས་ཞེས་བྱ་བ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་མཁྱེན་པ་གང་གིས་ལས་རྣམས་དང་།
en: Second power “The power of knowing the maturation of action.”

source: ལས་ལེན་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་རྒྱུ་དང་གནས་ལས་མཁྱེན་པ་སྟེ།
en: This is the knowledge of the lords with which they “know from the perspective of place and cause the maturations of actions and the undertaking of actions.”

source: གང་འདས་པའི་ལས་ལེན་པ། དགེ་བའི་རྒྱུ་ལས་བྱུང་བ། མི་དགེ་བ་དང་བྲལ་བ། མ་འོངས་པ་ན་དགེ་བའི་རྒྱུ་འབྱིན་པ་དེ་ལྟ་བུ་ཡང་ཡོད།
en: There is, for instance, the past undertaking of action arisen from a wholesome cause and separated from an unwholesome one, and the outcome of the wholesome cause in the future.

source: ད་ལྟར་བྱུང་བ་ན་ཁྱད་པར་ལ་བརྟེན་ལ། ལས་ལེན་པ་གང་མི་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ། དགེ་བ་དང་བྲལ་བ། མ་འོངས་པ་ན་མི་དགེ་བའི་རྒྱུ་འབྱིན་པ་ཡང་ཡོད།
en: There is also, contingent on a superior one in the present, the undertaking of an action arisen from an unwholesome cause and separated from a wholesome one, and the outcome of the unwholesome cause in the future.
